Mapas/app/controllers/users_controller.rb

  def index

    host = 'localhost'
    port =  MongoClient::DEFAULT_PORT
    database = MongoClient.new(host, port).db('ruby-mongo')
    ventas = database.collection('Ventas')
    cursorVentas = ventas.find.to_a

    cursorVentas.each do |venta|
      @user = User.new(title: venta["Cliente"], address: venta["Direccion"], description: venta["Organizacion"])
      @user.save
    end

    @users = User.all
---
INSERT INTO "users" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 20 May 2014 06:34:51 UTC +00:00], ["description", "DISTRIBUIDORA MATUSCHKA & HERNANDEZ S.A."], ["title", "5920406-8"], ["updated_at", Tue, 20 May 2014 06:34:51 UTC +00:00]]
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("address", "created_at", "description", "latitude", "longitude", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)